# Analysis of Retail Sales Data from UK

- Find the most important customers from all the transactions

- Segment the Data and Do Analysis of Segments using Tree Model

- Basic statistical analysis on various parameters

- Mostly sold item

- Most frequent customer

- Max value transaction

https://www.kaggle.com/datasets/carrie1/ecommerce-data

In [ ]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

#### Dataset source
https://archive.ics.uci.edu/ml/datasets/online+retail

In [ ]:
df1 = pd.read_excel("Online_Retail.xlsx")
df1.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...    17850.0  United Kingdom
1    536365     71053  ...    17850.0  United Kingdom
2    536365    84406B  ...    17850.0  United Kingdom
3    536365    84029G  ...    17850.0  United Kingdom
4    536365    84029E  ...    17850.0  United Kingdom

[5 rows x 8 columns]

In [ ]:
df1.shape

(541909, 8)

#Step 1. Basic Data Cleaning
We need to do santity check about the data

In [ ]:
df1.Country.nunique()

38

In [ ]:
df1.Country.value_counts()

United Kingdom          495478
Germany                   9495
France                    8557
EIRE                      8196
Spain                     2533
Netherlands               2371
Belgium                   2069
Switzerland               2002
Portugal                  1519
Australia                 1259
Norway                    1086
Italy                      803
Channel Islands            758
Finland                    695
Cyprus                     622
Sweden                     462
Unspecified                446
Austria                    401
Denmark                    389
Japan                      358
Poland                     341
Israel                     297
USA                        291
Hong Kong                  288
Singapore                  229
Iceland                    182
Canada                     151
Greece                     146
Malta                      127
United Arab Emirates        68
European Community          61
RSA                         58
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              30
Bahrain                     19
Saudi Arabia                10
Name: Country, dtype: int64

In [ ]:
df1.Country.unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Austria',
       'Israel', 'Finland', 'Bahrain', 'Greece', 'Hong Kong', 'Singapore',
       'Lebanon', 'United Arab Emirates', 'Saudi Arabia',
       'Czech Republic', 'Canada', 'Unspecified', 'Brazil', 'USA',
       'European Community', 'Malta', 'RSA'], dtype=object)

In [ ]:
customer_country=df1[['Country','CustomerID']].drop_duplicates()

x = customer_country.groupby(['Country'])['CustomerID'].aggregate('count')/customer_country.shape[0] * 100
x.reset_index().sort_values('CustomerID', ascending=False)

                 Country  CustomerID
36        United Kingdom   89.997722
14               Germany    2.164502
13                France    1.982228
31                 Spain    0.706311
3                Belgium    0.569606
33           Switzerland    0.478469
27              Portugal    0.432900
19                 Italy    0.341763
12               Finland    0.273411
1                Austria    0.250627
25                Norway    0.227842
24           Netherlands    0.205058
0              Australia    0.205058
6        Channel Islands    0.205058
9                Denmark    0.205058
7                 Cyprus    0.182274
32                Sweden    0.182274
20                 Japan    0.182274
26                Poland    0.136705
34                   USA    0.091137
5                 Canada    0.091137
37           Unspecified    0.091137
18                Israel    0.091137
15                Greece    0.091137
10                  EIRE    0.068353
23                 Malta    0.045568
35  United Arab Emirates    0.045568
2                Bahrain    0.045568
22             Lithuania    0.022784
8         Czech Republic    0.022784
21               Lebanon    0.022784
28                   RSA    0.022784
29          Saudi Arabia    0.022784
30             Singapore    0.022784
17               Iceland    0.022784
4                 Brazil    0.022784
11    European Community    0.022784
16             Hong Kong    0.000000

More than 90% of the customers in the data are from United Kingdom, SO we are interested only in UK data.

In [ ]:
df1 = df1.loc[df1['Country'] == 'United Kingdom']

In [ ]:
df1.isnull().sum()/df1.shape[0] * 100

InvoiceNo       0.000000
StockCode       0.000000
Description     0.293454
Quantity        0.000000
InvoiceDate     0.000000
UnitPrice       0.000000
CustomerID     26.963861
Country         0.000000
dtype: float64

In [ ]:
df1 = df1[df1['CustomerID'].isnull() == False] #pd.notnull
df1.isnull().sum(axis=0)

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

Check the min and max values in Unit price column

In [ ]:
df1.describe()

            Quantity      UnitPrice     CustomerID
count  361878.000000  361878.000000  361878.000000
mean       11.077029       3.256007   15547.871368
std       263.129266      70.654731    1594.402590
min    -80995.000000       0.000000   12346.000000
25%         2.000000       1.250000   14194.000000
50%         4.000000       1.950000   15514.000000
75%        12.000000       3.750000   16931.000000
max     80995.000000   38970.000000   18287.000000

Remove the negative values in Quantity column

In [ ]:
df1 = df1[(df1['Quantity']>0)]
df1.Quantity.min()

1

After cleaning up, we now dealing with 354345 rows and 8 columns

In [ ]:
df1.shape

(354345, 8)

In [ ]:
# df1.to_csv("Transactions_data.csv")

Check unique value for each column

In [ ]:
df1.nunique()

InvoiceNo      16649
StockCode       3645
Description     3844
Quantity         294
InvoiceDate    15615
UnitPrice        403
CustomerID      3921
Country            1
dtype: int64

In [ ]:
df1.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

Add a column for total price

In [ ]:
df1['TotalPrice'] = df1['Quantity'] * df1['UnitPrice']
df1.head()

  InvoiceNo StockCode  ...         Country  TotalPrice
0    536365    85123A  ...  United Kingdom       15.30
1    536365     71053  ...  United Kingdom       20.34
2    536365    84406B  ...  United Kingdom       22.00
3    536365    84029G  ...  United Kingdom       20.34
4    536365    84029E  ...  United Kingdom       20.34

[5 rows x 9 columns]

In [ ]:
df1.groupby(['InvoiceNo'])['TotalPrice'].sum()

InvoiceNo
536365    139.12
536366     22.20
536367    278.73
536368     70.05
536369     17.85
           ...
581582     29.88
581583    124.60
581584    140.64
581585    329.05
581586    339.20
Name: TotalPrice, Length: 16649, dtype: float64

# Analysis of the Data

We want to find most imp customers

Customers which are frequent

Customers which are frequent recently

Customers which are frequent recently and also spend a good amount (monetory value)

### SO :: Frequency, Recency and Monetory Value all are important

Find out first and last order date in the data

In [ ]:
df1['InvoiceDate'].min()

Timestamp('2010-12-01 08:26:00')

In [ ]:
df1['InvoiceDate'].max()

Timestamp('2011-12-09 12:49:00')

Since recency is calculated for a point in time. The last invoice date is 2011-12-09, this is the date we will use to calculate recency.

In [ ]:
import datetime as dt

In [ ]:
df1['InvoiceDate'] = pd.to_datetime(df1['InvoiceDate'])

In [ ]:
NOW = max(df1['InvoiceDate'])
NOW

Timestamp('2011-12-09 12:49:00')

# Create a RFM table

### 'recency', 'frequency' , 'monetary_value'

In [ ]:
rfmTable = df1.groupby('CustomerID').agg({'InvoiceDate': lambda x: (NOW - x.max()).days, # Recency
                                        'InvoiceNo': lambda x: len(x.unique()),      # Frequency
                                        'TotalPrice': lambda x: x.sum()}) # Monetary Value

rfmTable['InvoiceDate'] = rfmTable['InvoiceDate'].astype(int)

In [ ]:
def recency_calc(x):
  return (NOW - x.max()).days

def freq_calc(x):
  return len(x.unique())

def monetary_price_calc(x):
  return x.sum()

In [ ]:
rfmTable = df1.groupby('CustomerID').agg({'InvoiceDate': recency_calc, # Recency
                                        'InvoiceNo': freq_calc,      # Frequency
                                        'TotalPrice': monetary_price_calc}) # Monetary Value

rfmTable['InvoiceDate'] = rfmTable['InvoiceDate'].astype(int)

In [ ]:
rfmTable.columns

Index(['InvoiceDate', 'InvoiceNo', 'TotalPrice'], dtype='object')

In [ ]:
#rename function
rfmTable.columns = ['recency', 'frequency' , 'monetary_value']

Calculate RFM metrics for each customer

In [ ]:
rfmTable.head()

            recency  frequency  monetary_value
CustomerID
12346.0         325          1        77183.60
12747.0           1         11         4196.01
12748.0           0        210        33719.73
12749.0           3          5         4090.88
12820.0           2          4          942.34

#### 10 Customers with highest Monetory values

In [ ]:
rfmTable.sort_values(['monetary_value'],ascending = False).iloc[:10,:]

            recency  frequency  monetary_value
CustomerID
18102.0           0         60       259657.30
17450.0           7         46       194550.79
16446.0           0          2       168472.50
17511.0           2         31        91062.38
16029.0          38         63        81024.84
12346.0         325          1        77183.60
16684.0           3         28        66653.56
14096.0           3         17        65164.79
13694.0           3         50        65039.62
15311.0           0         91        60767.90

### Customers with maximum manitory ratio

Monitory value per visit

In [ ]:
rfmTable['m_ratio'] = rfmTable['monetary_value'] / rfmTable['frequency']

In [ ]:
rfmTable.sort_values(['m_ratio'],ascending = False).iloc[:10,:]

            recency  frequency  monetary_value       m_ratio
CustomerID
16446.0           0          2       168472.50  84236.250000
12346.0         325          1        77183.60  77183.600000
15749.0         234          3        44534.30  14844.766667
15098.0         181          3        39916.50  13305.500000
18102.0           0         60       259657.30   4327.621667
18251.0          86          1         4314.72   4314.720000
17450.0           7         46       194550.79   4229.365000
16000.0           2          3        12393.70   4131.233333
14088.0           9         13        50491.81   3883.985385
15195.0           2          1         3861.00   3861.000000

##### NOTE :: ONLY sorting will not work here

In [ ]:
rfmTable.sort_values(['frequency', 'monetary_value'], ascending=[True, False])

            recency  frequency  monetary_value       m_ratio
CustomerID
12346.0         325          1        77183.60  77183.600000
15195.0           2          1         3861.00   3861.000000
13135.0         196          1         3096.00   3096.000000
17846.0          84          1         2033.10   2033.100000
18133.0         211          1          931.50    931.500000
...             ...        ...             ...           ...
15311.0           0       2379        60767.90     25.543464
14606.0           0       2700        12156.65      4.502463
12748.0           0       4596        33719.73      7.336756
14096.0           3       5111        65164.79     12.749910
17841.0           1       7847        40991.57      5.223852

[3921 rows x 4 columns]

In [ ]:
rfmTable.sort_values(['recency'],ascending = True).iloc[:10,:]

            recency  frequency  monetary_value     m_ratio
CustomerID
15344.0           0         26          563.94   21.690000
17528.0           0        253         3628.50   14.341897
16626.0           0        179         4413.10   24.654190
13890.0           0        110         1883.81   17.125545
16933.0           0         44          563.23   12.800682
13860.0           0         76         1245.90   16.393421
13798.0           0        349        37153.85  106.458023
13777.0           0        197        25977.16  131.863756
16954.0           0         54         2085.08   38.612593
17491.0           0        109         3558.87   32.650183

In [ ]:
(NOW - dt.datetime(2011,1,18)).days==326

True

# Large Quantity, Large Frequency and Large Monitory Value Customers

In [ ]:
rfmTable = df1.groupby('CustomerID').agg({'InvoiceDate': lambda x: (NOW - x.max()).days, # Recency
                                        'InvoiceNo': lambda x: len(x.unique()),      # Frequency
                                        'TotalPrice': lambda x: x.sum(),
                                        'Quantity':lambda x : x.sum()}) # Monetary Value

rfmTable['InvoiceDate'] = rfmTable['InvoiceDate'].astype(int)

In [ ]:
#rename function
rfmTable.columns = ['recency', 'frequency' , 'monetary_value','Quantity']

In [ ]:
rfmTable['Quantity_ratio'] = rfmTable['monetary_value'] * rfmTable['frequency']
rfmTable.sort_values('Quantity_ratio',ascending = False,inplace=True)
rfmTable.head()

            recency  frequency  monetary_value  Quantity  Quantity_ratio
CustomerID
18102.0           0         60       259657.30     64124     15579438.00
17450.0           7         46       194550.79     69993      8949336.34
12748.0           0        210        33719.73     25748      7081143.30
13089.0           2         97        58825.83     31070      5706105.51
15311.0           0         91        60767.90     38194      5529878.90

In [ ]:
df1.loc[df1['CustomerID'] == 17450]

       InvoiceNo StockCode  ...         Country  TotalPrice
14059     537448     21756  ...  United Kingdom       39.60
14067     537456     22469  ...  United Kingdom      775.86
14068     537456     22470  ...  United Kingdom     1213.38
52131     540689     21733  ...  United Kingdom     2786.40
52132     540689    85123A  ...  United Kingdom     3272.40
...          ...       ...  ...             ...         ...
517563    580063     82583  ...  United Kingdom      229.44
517564    580063     82600  ...  United Kingdom      229.44
517565    580063     21174  ...  United Kingdom      344.16
517566    580063     21166  ...  United Kingdom      688.32
517567    580063     82580  ...  United Kingdom       71.04

[337 rows x 9 columns]

In [ ]:
df1.describe()

            Quantity      UnitPrice     CustomerID     TotalPrice
count  354345.000000  354345.000000  354345.000000  354345.000000
mean       12.048913       2.963793   15552.436219      20.625073
std       190.428127      17.862067    1594.546025     326.033014
min         1.000000       0.000000   12346.000000       0.000000
25%         2.000000       1.250000   14194.000000       4.160000
50%         4.000000       1.950000   15522.000000      10.200000
75%        12.000000       3.750000   16931.000000      17.700000
max     80995.000000    8142.750000   18287.000000  168469.600000

# Quartile wise Analysis

The easies way to split metrics into segments is by using quartile. 

1. This gives us a starting point for detailed analysis
2. 4 segments are easy to understand and explain

In [ ]:
rfmTable.describe()

           recency    frequency  monetary_value      Quantity  Quantity_ratio
count  3921.000000  3921.000000     3921.000000   3921.000000    3.921000e+03
mean     91.188472     4.246111     1863.910113   1088.873247    3.532274e+04
std      99.528995     7.205750     7481.922217   3741.619824    3.771969e+05
min       0.000000     1.000000        0.000000      1.000000    0.000000e+00
25%      17.000000     1.000000      300.040000    154.000000    3.450000e+02
50%      50.000000     2.000000      651.820000    365.000000    1.414530e+03
75%     142.000000     5.000000     1575.890000    951.000000    7.032950e+03
max     373.000000   210.000000   259657.300000  80997.000000    1.557944e+07

In [ ]:
quantiles = rfmTable.quantile(q=[0.05,0.25,0.5,0.75,0.95])
quantiles

      recency  frequency  monetary_value  Quantity  Quantity_ratio
0.05      2.0        1.0          110.75      44.0          112.75
0.25     17.0        1.0          300.04     154.0          345.00
0.50     50.0        2.0          651.82     365.0         1414.53
0.75    142.0        5.0         1575.89     951.0         7032.95
0.95    310.0       13.0         5493.46    3412.0        67841.90

In [ ]:
quantiles = quantiles.to_dict()
quantiles

{'Quantity': {0.05: 44.0, 0.25: 154.0, 0.5: 365.0, 0.75: 951.0, 0.95: 3412.0},
 'Quantity_ratio': {0.05: 112.75000000000001,
  0.25: 345.0,
  0.5: 1414.53,
  0.75: 7032.950000000001,
  0.95: 67841.90000000001},
 'frequency': {0.05: 1.0, 0.25: 1.0, 0.5: 2.0, 0.75: 5.0, 0.95: 13.0},
 'monetary_value': {0.05: 110.75,
  0.25: 300.03999999999996,
  0.5: 651.8199999999999,
  0.75: 1575.89,
  0.95: 5493.46},
 'recency': {0.05: 2.0, 0.25: 17.0, 0.5: 50.0, 0.75: 142.0, 0.95: 310.0}}

Create a segmented RFM table

In [ ]:
segmented_rfm = rfmTable

Lowest recency, highest frequency and monetary are our best customers

### Segment Customers on Recency using Quantiles

In [ ]:
def RScore_simple(x): # Simple recency score function with fixed values
    if x <= 17.0:
        return 1
    elif x <= 50.0:
        return 2
    elif x <= 141.5: 
        return 3
    else:
        return 4

In [ ]:
def RScore(x,p,d): # Recency score segmentation by using quantile 
    if x <= d[p][0.25]:#17.0
        return 1
    elif x <= d[p][0.50]:#50.0
        return 2
    elif x <= d[p][0.75]: 
        return 3
    else:
        return 4
    
def FMScore(x,p,d): # Single function to segment frequency and monetory value by parameters
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.50]:
        return 3
    elif x <= d[p][0.75]: 
        return 2
    else:
        return 1

Add segment numbers to the RFM table

In [ ]:
segmented_rfm['r_quartile'] = segmented_rfm['recency'].apply(RScore_simple)#, args=('recency',quantiles,))
segmented_rfm['f_quartile'] = segmented_rfm['frequency'].apply(FMScore, args=('frequency',quantiles,))
segmented_rfm['m_quartile'] = segmented_rfm['monetary_value'].apply(FMScore, args=('monetary_value',quantiles,))

In [ ]:
segmented_rfm.head()

            recency  frequency  ...  f_quartile  m_quartile
CustomerID                      ...
18102.0           0         60  ...           1           1
17450.0           7         46  ...           1           1
12748.0           0        210  ...           1           1
13089.0           2         97  ...           1           1
15311.0           0         91  ...           1           1

[5 rows x 8 columns]

RFM segments split your customer base into an imaginary 3D cube. It is hard to visualize. However, we can sort it out.

Add a new column to combine RFM score, 111 is the highest score as we determined earlier.

In [ ]:
segmented_rfm['RFMScore'] = segmented_rfm.r_quartile.map(str) \
                            + segmented_rfm.f_quartile.map(str) \
                            + segmented_rfm.m_quartile.map(str)
segmented_rfm.head()

            recency  frequency  monetary_value  ...  f_quartile  m_quartile  RFMScore
CustomerID                                      ...
18102.0           0         60       259657.30  ...           1           1       111
17450.0           7         46       194550.79  ...           1           1       111
12748.0           0        210        33719.73  ...           1           1       111
13089.0           2         97        58825.83  ...           1           1       111
15311.0           0         91        60767.90  ...           1           1       111

[5 rows x 9 columns]

In [ ]:
segmented_rfm['RFMScore'].unique()

array(['111', '211', '131', '411', '421', '311', '441', '212', '121',
       '321', '221', '112', '312', '331', '222', '122', '322', '422',
       '231', '412', '431', '341', '141', '413', '313', '113', '432',
       '223', '332', '123', '232', '132', '423', '323', '241', '342',
       '114', '242', '442', '333', '133', '433', '233', '142', '424',
       '124', '224', '324', '443', '343', '143', '243', '434', '234',
       '334', '134', '414', '444', '344', '244', '144'], dtype=object)

In [ ]:
len(segmented_rfm['RFMScore'].unique())

61

Apparently, the first customer is not our best customer at all.

Here is top 10 of our best customers!

In [ ]:
segmented_rfm[segmented_rfm['RFMScore']=='111'].sort_values('monetary_value', ascending=False).head(10)

            recency  frequency  monetary_value  ...  f_quartile  m_quartile  RFMScore
CustomerID                                      ...
18102.0           0         60       259657.30  ...           1           1       111
17450.0           7         46       194550.79  ...           1           1       111
17511.0           2         31        91062.38  ...           1           1       111
16684.0           3         28        66653.56  ...           1           1       111
14096.0           3         17        65164.79  ...           1           1       111
13694.0           3         50        65039.62  ...           1           1       111
15311.0           0         91        60767.90  ...           1           1       111
13089.0           2         97        58825.83  ...           1           1       111
17949.0           0         45        58510.48  ...           1           1       111
15769.0           6         26        56252.72  ...           1           1       111

[10 rows x 9 columns]

In [ ]:
segmented_rfm[segmented_rfm['RFMScore']=='441'].sort_values('monetary_value', ascending=False).head(10)

            recency  frequency  monetary_value  ...  f_quartile  m_quartile  RFMScore
CustomerID                                      ...
12346.0         325          1        77183.60  ...           4           1       441
13135.0         196          1         3096.00  ...           4           1       441
17597.0         213          1         2044.37  ...           4           1       441
16754.0         371          1         2002.40  ...           4           1       441
14459.0         154          1         1837.92  ...           4           1       441
16152.0         268          1         1829.04  ...           4           1       441

[6 rows x 9 columns]

# Tree Based Segmentation

In [ ]:
rfmTable[ (rfmTable['recency'] < 50) & (rfmTable['frequency'] > 10) ]

            recency  frequency  monetary_value    m_ratio
CustomerID
12747.0           1        103         4196.01  40.737961
12748.0           0       4596        33719.73   7.336756
12749.0           3        199         4090.88  20.557186
12820.0           2         59          942.34  15.971864
12826.0           2         91         1474.72  16.205714
...             ...        ...             ...        ...
18274.0          29         11          175.92  15.992727
18276.0          43         14          335.86  23.990000
18282.0           7         12          178.05  14.837500
18283.0           3        756         2094.88   2.771005
18287.0          42         70         1837.28  26.246857

[1809 rows x 4 columns]

In [ ]:
max_quant = df1['Quantity'].max()
mask = (df1['Country'] == 'United Kingdom') & (df1['Quantity'] > 100) & (df1['TotalPrice'] < 1000 )
df1[mask].shape

(3030, 9)

# Discussion:

- Can only Monetory value make customer IMP ?

- Can Frequency make a customer IMP?

- Any other parameters to find IMP customers ?

# NEXT LEVEL

- how to use prediction model to predict monetory value ?

- What can be hypothesis testing applied here?